articles/live-neofetch/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-06-15 Tue 23:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Keeping a Live Neofetch on GitHub</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="../../styles.css">
</head>
<body>
<div id="content">
<h1 class="title">Keeping a Live Neofetch on GitHub</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org03de1d1">1. Git Hooks</a></li>
<li><a href="#orga400392">2. Updating my Neofetch file</a></li>
</ul>
</div>
</div>
<p>
If you haven't been to my GitHub before, you won't have seen my <a href="https://github.com/samueltwallace/avoidance-inspiron-dotfiles">dotfiles repo</a> before (or my old <a href="https://github.com/samueltwallace/dotfiles-inspiron/">Ubuntu Dotfiles</a>). If you notice, I have a <code>curl</code>-able neofetch of my system there. I have devised a way to keep it updated everytime I update my dotfiles, so no more manually updating the file, adding it to my bare git repository for my dotfiles, and then commiting and pushing. I used the magic of Git hooks to make it automatic.
</p>

<div id="outline-container-org03de1d1" class="outline-2">
<h2 id="org03de1d1"><span class="section-number-2">1</span> Git Hooks</h2>
<div class="outline-text-2" id="text-1">
<p>
Git hooks were something I did not know about until recently until I made a bare git repository and got into the guys of what typically goes into a .git folder. I saw this mysterious <code>hooks</code> folder and decided to investigate the folder with Google in another tab. After learning a little bit about them, I think this is the kind of thing that could be a major boost in my workflow. 
</p>

<p>
Git hooks are scripts that execute when you execute git commands from the command line. This could be a commit, a push, merge, or a rebase, and could either be executed before or after the actions is taken. They are super easy to organize and use.
</p>

<p>
All the scripts you want to happened go into the <code>.git/hooks</code> folder in the repo you want the scripts to activate for. Note that these scripts need to have special names, need to be executable, and only run on the machine that the folder is on (so if you push changes, the hooks won't be hooked!). Then you can write any script you want. The list of acceptable hook names are listed in an unmodified git directory in its hooks folder, but some examples include:
</p>

<ul class="org-ul">
<li>pre-commit</li>
<li>pre-merge-commit</li>
<li>prepare-commit-msg</li>
<li>pre-push</li>
</ul>
</div>
</div>

<div id="outline-container-orga400392" class="outline-2">
<h2 id="orga400392"><span class="section-number-2">2</span> Updating my Neofetch file</h2>
<div class="outline-text-2" id="text-2">
<p>
In my <code>$HOME</code>, I have a file called <code>neofetch</code> that contains the output of <code>date &amp;&amp; neofetch</code>. I used to update this every so often when I committed my dotfiles by running <code>echo "$(date &amp;&amp; neofetch)" &gt; $HOME/neofetch</code> whenever I remembered to. I would then add the file to be committed, then commit and push.
</p>

<p>
Now, I have a <code>pre-commit</code> hook that reads
</p>

<pre class="example">
#!/bin/bash

echo "$(date &amp;&amp; neofetch)" &gt; $HOME/neofetch ==
echo "Update neofetch file" ==
git --git-dir=path/to/bare/repo --work-tree=$HOME add $HOME/neofetch ==
</pre>

<p>
And now when I commit, it updates the Neofetch file and adds it to be committed, and it gets pushed in the commit. Now I never have to manually update this file. This simple example shows the power of Git hooks, and I'm going to start making them a common occurrence in my workflow.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-06-15 Tue 23:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
